# Export Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CustomExporter..::..Export Method
CustomExporter Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Export(IList<(Of <<'(ElementId>)>>)) | Exports a collection of 3D or 2D views |
| Export(View) | Exports one 3D or 2D view |

# See Also
CustomExporter Class
CustomExporter Members
Autodesk.Revit.DB Namespace